#language: ru

@RNS-1
Функционал: Калькулятор накопительного вклада

  Сценарий: Расчет накопительного вклада №1

    * Выбран пункт главного меню "Вклады"
    * Выбрана валюта "Рубли"

    * Заполняются поля
      |Сумма вклада             |300 000 ₽ |
      |На срок                  |6 месяцев |
      |Ежемесячное пополнение   |50 000 ₽  |

    * Отмечено "Ежемесячная капитализация"

    * Проверяем результат
      |Ожидаемая сумма к снятию |561 383,43 ₽|

  Сценарий: Расчет накопительного вклада №2

    * Выбран пункт главного меню "Вклады"
    * Выбрана валюта "Рубли"

    * Заполняются поля
      |Сумма вклада             |500 000 ₽ |
      |На срок                  |6 месяцев |
      |Ежемесячное пополнение   |70 000 ₽  |

    * Отмечено "Ежемесячная капитализация"

    * Проверяем результат
      |Ожидаемая сумма к снятию |868 082,81 ₽|

